app/views/OWS/Name/InsertAddress.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:core="http://webservices.micros.com/og/4.3/Core/" xmlns:name="http://webservices.micros.com/ows/5.1/Name.wsdl" xmlns:com="http://webservices.micros.com/og/4.3/Common/">
   <soapenv:Header>
      <core:OGHeader transactionID="{transactionID}" primaryLangID="E" timeStamp="{timeStamp}" xmlns="http://webservices.micros.com/og/4.3/Core/">
         <core:Origin entityID="{hotelCode}" systemType="WEB"/>
         <core:Destination entityID="{hotelCode}" systemType="PMS"/>
      </core:OGHeader>
   </soapenv:Header>
   <soapenv:Body>
      <name:InsertAddressRequest>
      	 <name:NameID type="INTERNAL">{NameID}</name:NameID>
         <name:NameAddress addressType="{addressType}">
            <com:AddressLine>{AddressLine}</com:AddressLine>
			<com:AddressLine>{AddressLine2}</com:AddressLine>
			<com:AddressLine>{AddressLine3}</com:AddressLine>
            <com:cityName>{cityName}</com:cityName>
            <com:stateProv>{stateProv}</com:stateProv>
            <com:countryCode>{countryCode}</com:countryCode>
            <com:postalCode>{postalCode}</com:postalCode>
         </name:NameAddress>
      </name:InsertAddressRequest>
   </soapenv:Body>
</soapenv:Envelope>